
# Installation

In [99]:
!pip install pandas
#!pip install pandas==2.0.3

Requirement already satisfied: pandas in /usr/local/lib/python3.10/dist-packages (2.1.4)
Requirement already satisfied: numpy<2,>=1.22.4 in /usr/local/lib/python3.10/dist-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in /usr/local/lib/python3.10/dist-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /usr/local/lib/python3.10/dist-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.1 in /usr/local/lib/python3.10/dist-packages (from pandas) (2024.1)
Requirement already satisfied: six>=1.5 in /usr/local/lib/python3.10/dist-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [100]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.1.4
1.26.4

# Series

- Documentation: https://pandas.pydata.org/docs/reference/api/pandas.Series.html

## Creating series

In [101]:
data_series = pd.Series([10, 20, 30, 40, 50])
print(data_series)

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [102]:
type(data_series)

pandas.core.series.Series

In [103]:
int_array = [10, 20, 30, 40, 50]
indexes = ['A', 'B', 'C', 'D', 'E']
data_series = pd.Series(int_array, index = indexes)
print(data_series)

A    10
B    20
C    30
D    40
E    50
dtype: int64

In [104]:
np_int_array = np.array([10, 20, 30, 40, 50])
print(np_int_array)

[10 20 30 40 50]

In [105]:
type(np_int_array)

numpy.ndarray

In [106]:
data_series = pd.Series(np_int_array)
print(data_series)

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [107]:
data_series.shape

(5,)

In [108]:
data_series.ndim

1

In [109]:
data_series.size

5

In [110]:
data_series.index = ['Z', 'X', 'V', 'A', 'B']
data_series

Z    10
X    20
V    30
A    40
B    50
dtype: int64

In [111]:
values = np.random.random(10)
indexes = np.arange(0,10)

print(values)
print(indexes)

[0.81373705 0.17658699 0.09202101 0.75055963 0.55680401 0.71423301
 0.93447736 0.76436975 0.61482232 0.2548048 ]
[0 1 2 3 4 5 6 7 8 9]

In [112]:
type(values), type(indexes)

(numpy.ndarray, numpy.ndarray)

In [113]:
data_series = pd.Series(values, indexes)
print(data_series)

0    0.813737
1    0.176587
2    0.092021
3    0.750560
4    0.556804
5    0.714233
6    0.934477
7    0.764370
8    0.614822
9    0.254805
dtype: float64

In [114]:
data_series.index

Index([0, 1, 2, 3, 4, 5, 6, 7, 8, 9], dtype='int64')

In [115]:
dictionary = {'John': 10, 'Alice': 5, 'Peter': 9}
type(dictionary)

dict

In [116]:
dictionary

{'John': 10, 'Alice': 5, 'Peter': 9}

In [117]:
dict_data_series = pd.Series(dictionary)
print(dict_data_series)

John     10
Alice     5
Peter     9
dtype: int64

In [118]:
dict_data_series.dtype

dtype('int64')

## Slicing

In [119]:
data_series[:]

0    0.813737
1    0.176587
2    0.092021
3    0.750560
4    0.556804
5    0.714233
6    0.934477
7    0.764370
8    0.614822
9    0.254805
dtype: float64

In [166]:
data_series[0:3]

0    0.813737
1    0.176587
2    0.092021
dtype: float64

In [167]:
data_series[:4]

0    0.813737
1    0.176587
2    0.092021
3    0.750560
dtype: float64

In [122]:
data_series[-1:]

9    0.254805
dtype: float64

In [123]:
data_series[:-1]

0    0.813737
1    0.176587
2    0.092021
3    0.750560
4    0.556804
5    0.714233
6    0.934477
7    0.764370
8    0.614822
dtype: float64

In [168]:
s2 = data_series[:3]
s2

0    0.813737
1    0.176587
2    0.092021
dtype: float64

## Copy, conversion, and concatenation

In [169]:
#data_series2 = data_series
data_series2 = data_series.copy()
data_series2

0    0.813737
1    0.176587
2    0.092021
3    0.750560
4    0.556804
5    0.714233
6    0.934477
7    0.764370
8    0.614822
9    0.254805
dtype: float64

In [126]:
data_series2.dtype

dtype('float64')

In [127]:
data_series2 = data_series2.astype(int)

In [128]:
data_series2.dtype

dtype('int64')

In [129]:
data_series2

0    0
1    0
2    0
3    0
4    0
5    0
6    0
7    0
8    0
9    0
dtype: int64

In [170]:
data_series

0    0.813737
1    0.176587
2    0.092021
3    0.750560
4    0.556804
5    0.714233
6    0.934477
7    0.764370
8    0.614822
9    0.254805
dtype: float64

In [171]:
new_data = {'Jessica': 20, 'Maria': 30}
data_series3 = pd.Series(new_data)
data_series3

Jessica    20
Maria      30
dtype: int64

In [172]:
dict_data_series

John     10
Alice     5
Peter     9
dtype: int64

In [173]:
data_series4 = pd.concat([dict_data_series, data_series3])
data_series4

John       10
Alice       5
Peter       9
Jessica    20
Maria      30
dtype: int64

## Accessing elements with iloc

- Elements by indexes

In [174]:
import pandas as pd
dataset = pd.read_csv('/content/sample_data/census.csv')

In [175]:
type(dataset)

pandas.core.frame.DataFrame

In [176]:
dataset

,age,workclass,final-weight,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loos,hour-per-week,native-country,income
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
32556,27,Private,257302,Assoc-acdm,12,Married-civ-spouse,Tech-support,Wife,White,Female,0,0,38,United-States,<=50K
32557,40,Private,154374,HS-grad,9,Married-civ-spouse,Machine-op-inspct,Husband,White,Male,0,0,40,United-States,>50K
32558,58,Private,151910,HS-grad,9,Widowed,Adm-clerical,Unmarried,White,Female,0,0,40,United-States,<=50K
32559,22,Private,201490,HS-grad,9,Never-married,Adm-clerical,Own-child,White,Male,0,0,20,United-States,<=50K
32560,52,Self-emp-inc,287927,HS-grad,9,Married-civ-spouse,Exec-managerial,Wife,White,Female,15024,0,40,United-States,>50K

In [177]:
age_series = dataset['age']
age_series

0        39
1        50
2        38
3        53
4        28
         ..
32556    27
32557    40
32558    58
32559    22
32560    52
Name: age, Length: 32561, dtype: int64

In [178]:
type(age_series)

pandas.core.series.Series

In [179]:
age_series.head()

0    39
1    50
2    38
3    53
4    28
Name: age, dtype: int64

In [180]:
age_series.head(10)

0    39
1    50
2    38
3    53
4    28
5    37
6    49
7    52
8    31
9    42
Name: age, dtype: int64

In [181]:
age_series.tail()

32556    27
32557    40
32558    58
32559    22
32560    52
Name: age, dtype: int64

In [182]:
age_series.tail(10)

32551    32
32552    43
32553    32
32554    53
32555    22
32556    27
32557    40
32558    58
32559    22
32560    52
Name: age, dtype: int64

In [183]:
age_series.iloc[0]

39

In [184]:
age_series.iloc[32560]

52

In [185]:
age_series.iloc[-1]

52

In [186]:
age_series[0:3]

0    39
1    50
2    38
Name: age, dtype: int64

In [187]:
age_series[0:5]

0    39
1    50
2    38
3    53
4    28
Name: age, dtype: int64

In [188]:
age_series[[0, 2, 4]]

0    39
2    38
4    28
Name: age, dtype: int64

In [189]:
age_list = []
for i in age_series.items():
  #print(i)
  #print(i[0], i[1])
  if i[1] > 50:
    age_list.append(i[0])

In [190]:
print(age_list)

[3, 7, 21, 24, 25, 27, 41, 45, 46, 67, 74, 77, 81, 83, 85, 90, 100, 112, 115, 116, 118, 140, 144, 148, 154, 157, 160, 169, 172, 187, 189, 202, 208, 213, 214, 221, 222, 223, 224, 226, 227, 228, 229, 235, 245, 246, 252, 254, 263, 267, 270, 283, 285, 295, 303, 316, 319, 324, 325, 328, 329, 333, 334, 346, 348, 354, 356, 361, 366, 368, 380, 399, 416, 428, 430, 447, 452, 461, 466, 470, 474, 484, 486, 487, 499, 501, 502, 503, 511, 515, 527, 534, 536, 546, 552, 555, 561, 564, 571, 578, 580, 581, 582, 588, 589, 591, 592, 602, 606, 610, 618, 622, 634, 639, 641, 647, 648, 656, 679, 686, 690, 708, 729, 731, 738, 741, 746, 752, 756, 761, 763, 764, 774, 779, 786, 788, 794, 796, 802, 808, 817, 818, 825, 826, 831, 833, 834, 835, 839, 842, 843, 844, 850, 857, 872, 873, 874, 885, 888, 900, 901, 909, 912, 917, 918, 924, 927, 932, 945, 952, 954, 967, 972, 978, 983, 985, 989, 995, 1005, 1006, 1008, 1010, 1017, 1025, 1034, 1036, 1040, 1046, 1050, 1051, 1053, 1061, 1062, 1082, 1096, 1100, 1113, 1115, 1118, 1119, 1127, 1142, 1144, 1148, 1153, 1161, 1163, 1166, 1168, 1170, 1175, 1185, 1186, 1187, 1190, 1196, 1197, 1205, 1206, 1213, 1215, 1222, 1223, 1229, 1231, 1241, 1243, 1245, 1246, 1250, 1253, 1257, 1261, 1262, 1263, 1275, 1277, 1280, 1282, 1287, 1290, 1291, 1302, 1313, 1320, 1323, 1327, 1333, 1334, 1338, 1341, 1343, 1346, 1349, 1354, 1355, 1361, 1363, 1367, 1368, 1371, 1377, 1378, 1392, 1396, 1397, 1398, 1401, 1413, 1414, 1424, 1429, 1431, 1435, 1441, 1444, 1448, 1451, 1455, 1458, 1465, 1470, 1473, 1481, 1482, 1488, 1493, 1503, 1504, 1506, 1513, 1514, 1517, 1528, 1541, 1543, 1544, 1552, 1554, 1562, 1563, 1575, 1579, 1586, 1590, 1593, 1601, 1603, 1605, 1610, 1613, 1615, 1625, 1626, 1627, 1631, 1635, 1639, 1640, 1643, 1644, 1645, 1649, 1659, 1663, 1668, 1672, 1676, 1688, 1693, 1695, 1699, 1706, 1710, 1721, 1726, 1735, 1739, 1753, 1754, 1758, 1761, 1768, 1772, 1777, 1789, 1799, 1802, 1806, 1808, 1809, 1810, 1812, 1818, 1824, 1825, 1831, 1834, 1836, 1837, 1844, 1851, 1862, 1865, 1875, 1886, 1887, 1890, 1891, 1894, 1901, 1912, 1929, 1935, 1941, 1946, 1951, 1954, 1956, 1957, 1961, 1968, 1980, 1984, 1986, 1997, 1999, 2002, 2003, 2006, 2017, 2031, 2041, 2044, 2047, 2051, 2064, 2067, 2072, 2073, 2076, 2080, 2086, 2093, 2097, 2098, 2099, 2101, 2108, 2109, 2113, 2118, 2136, 2140, 2142, 2143, 2147, 2154, 2155, 2158, 2163, 2169, 2173, 2176, 2177, 2179, 2184, 2189, 2200, 2202, 2213, 2214, 2219, 2221, 2229, 2230, 2236, 2241, 2242, 2244, 2245, 2246, 2247, 2254, 2293, 2294, 2303, 2308, 2309, 2310, 2315, 2317, 2318, 2319, 2324, 2328, 2330, 2334, 2348, 2358, 2371, 2372, 2373, 2374, 2377, 2383, 2385, 2396, 2402, 2403, 2404, 2410, 2416, 2420, 2421, 2424, 2426, 2430, 2431, 2441, 2442, 2456, 2462, 2464, 2478, 2479, 2483, 2486, 2487, 2488, 2489, 2491, 2498, 2502, 2503, 2504, 2505, 2507, 2511, 2517, 2521, 2523, 2524, 2540, 2543, 2548, 2552, 2556, 2558, 2563, 2566, 2569, 2570, 2573, 2578, 2580, 2584, 2585, 2592, 2594, 2599, 2601, 2615, 2626, 2629, 2633, 2634, 2635, 2638, 2646, 2665, 2670, 2676, 2679, 2681, 2682, 2684, 2687, 2690, 2691, 2700, 2702, 2707, 2715, 2718, 2730, 2731, 2737, 2746, 2751, 2752, 2754, 2760, 2762, 2774, 2780, 2781, 2784, 2785, 2790, 2791, 2793, 2810, 2811, 2828, 2830, 2832, 2833, 2837, 2852, 2867, 2877, 2882, 2884, 2885, 2891, 2892, 2897, 2901, 2905, 2906, 2909, 2920, 2922, 2927, 2941, 2955, 2956, 2961, 2967, 2974, 2977, 2983, 2986, 2991, 2999, 3001, 3013, 3017, 3020, 3021, 3022, 3030, 3035, 3036, 3045, 3046, 3048, 3050, 3056, 3057, 3065, 3082, 3089, 3092, 3101, 3107, 3116, 3120, 3125, 3129, 3135, 3137, 3149, 3152, 3153, 3158, 3159, 3163, 3166, 3178, 3184, 3188, 3191, 3192, 3197, 3199, 3209, 3211, 3213, 3217, 3219, 3221, 3224, 3226, 3231, 3232, 3233, 3247, 3270, 3274, 3275, 3278, 3291, 3292, 3297, 3301, 3302, 3307, 3311, 3315, 3324, 3327, 3329, 3335, 3338, 3341, 3360, 3365, 3369, 3387, 3389, 3395, 3399, 3401, 3402, 3407, 3414, 3415, 3427, 3434, 3437, 3438, 3444, 3447, 3461, 3470, 3480, 3485, 3490, 3510, 3511, 3515, 3518, 3519, 3521, 3523, 3533, 3537, 3547, 3552, 3556, 3559, 3562, 3563, 3564, 3567, 3571, 3574, 3577, 3580, 3587, 3588, 3593, 3594, 3600, 3602, 3603, 3606, 3610, 3612, 3620, 3621, 3624, 3631, 3633, 3640, 3642, 3647, 3660, 3661, 3664, 3666, 3671, 3677, 3685, 3689, 3693, 3699, 3700, 3723, 3733, 3749, 3759, 3761, 3765, 3771, 3772, 3773, 3777, 3778, 3779, 3780, 3782, 3788, 3792, 3795, 3796, 3797, 3800, 3808, 3817, 3822, 3830, 3836, 3839, 3842, 3854, 3857, 3861, 3863, 3866, 3867, 3876, 3878, 3880, 3881, 3882, 3883, 3884, 3889, 3894, 3895, 3896, 3900, 3904, 3905, 3906, 3911, 3915, 3920, 3923, 3926, 3927, 3931, 3934, 3940, 3957, 3961, 3963, 3969, 3976, 3980, 3983, 3988, 3990, 3992, 3996, 4000, 4007, 4009, 4018, 4027, 4043, 4048, 4063, 4064, 4065, 4070, 4077, 4082, 4083, 4096, 4101, 4102, 4107, 4109, 4116, 4120, 4125, 4126, 4133, 4144, 4147, 4148, 4155, 4164, 4170, 4176, 4181, 4182, 4185, 4189, 4196, 4197, 4202, 4203, 4207, 4212, 4215, 4227, 4232, 4236, 4238, 4248, 4249, 4270, 4273, 4278, 4281, 4283, 4285, 4288, 4307, 4309, 4315, 4316, 4326, 4329, 4330, 4331, 4344, 4345, 4346, 4349, 4353, 4354, 4376, 4385, 4386, 4387, 4397, 4407, 4408, 4410, 4414, 4418, 4420, 4421, 4422, 4428, 4429, 4430, 4433, 4437, 4438, 4445, 4448, 4449, 4464, 4466, 4473, 4475, 4484, 4486, 4491, 4507, 4518, 4521, 4523, 4524, 4530, 4539, 4549, 4552, 4558, 4565, 4570, 4577, 4581, 4584, 4587, 4597, 4600, 4613, 4627, 4632, 4638, 4641, 4643, 4657, 4673, 4674, 4677, 4686, 4691, 4692, 4699, 4704, 4720, 4721, 4729, 4730, 4743, 4748, 4749, 4750, 4752, 4755, 4759, 4760, 4764, 4766, 4772, 4782, 4793, 4799, 4805, 4812, 4813, 4819, 4822, 4830, 4831, 4832, 4834, 4836, 4841, 4842, 4850, 4851, 4857, 4867, 4890, 4903, 4909, 4948, 4950, 4955, 4959, 4965, 4970, 4974, 4977, 4989, 4999, 5001, 5007, 5009, 5014, 5025, 5026, 5028, 5031, 5035, 5038, 5040, 5044, 5050, 5051, 5053, 5062, 5071, 5072, 5079, 5085, 5089, 5096, 5102, 5103, 5104, 5106, 5109, 5113, 5127, 5129, 5133, 5134, 5141, 5143, 5151, 5155, 5156, 5168, 5177, 5186, 5187, 5189, 5193, 5197, 5198, 5201, 5207, 5214, 5219, 5222, 5223, 5224, 5226, 5231, 5232, 5239, 5244, 5249, 5250, 5264, 5267, 5269, 5272, 5282, 5291, 5294, 5299, 5301, 5326, 5327, 5330, 5331, 5340, 5344, 5359, 5362, 5370, 5374, 5377, 5379, 5385, 5392, 5405, 5406, 5409, 5411, 5416, 5417, 5418, 5421, 5429, 5431, 5433, 5435, 5451, 5456, 5463, 5471, 5474, 5478, 5480, 5488, 5490, 5492, 5497, 5499, 5501, 5513, 5524, 5529, 5536, 5548, 5549, 5551, 5554, 5555, 5561, 5566, 5574, 5575, 5577, 5585, 5588, 5590, 5594, 5595, 5602, 5605, 5608, 5612, 5625, 5631, 5634, 5642, 5651, 5652, 5660, 5663, 5665, 5666, 5668, 5679, 5680, 5681, 5682, 5685, 5686, 5687, 5691, 5695, 5697, 5698, 5701, 5743, 5747, 5749, 5751, 5755, 5757, 5764, 5766, 5773, 5774, 5787, 5789, 5794, 5808, 5813, 5821, 5824, 5827, 5830, 5832, 5834, 5848, 5855, 5861, 5862, 5863, 5866, 5870, 5874, 5881, 5883, 5888, 5903, 5905, 5909, 5916, 5919, 5925, 5936, 5937, 5938, 5940, 5947, 5956, 5958, 5968, 5971, 5975, 5985, 5986, 6000, 6002, 6004, 6008, 6015, 6016, 6020, 6022, 6024, 6030, 6031, 6035, 6039, 6045, 6046, 6050, 6051, 6058, 6071, 6073, 6074, 6075, 6085, 6091, 6092, 6096, 6097, 6098, 6100, 6104, 6110, 6114, 6116, 6117, 6119, 6123, 6127, 6129, 6130, 6134, 6141, 6142, 6144, 6146, 6147, 6157, 6165, 6167, 6169, 6172, 6173, 6178, 6179, 6180, 6184, 6214, 6217, 6220, 6222, 6224, 6227, 6231, 6232, 6233, 6237, 6248, 6255, 6256, 6265, 6270, 6275, 6278, 6279, 6280, 6281, 6298, 6300, 6303, 6304, 6315, 6330, 6332, 6342, 6359, 6362, 6363, 6366, 6369, 6372, 6379, 6382, 6385, 6387, 6401, 6407, 6416, 6424, 6434, 6439, 6442, 6444, 6447, 6449, 6455, 6457, 6460, 6461, 6465, 6467, 6469, 6472, 6484, 6485, 6486, 6490, 6507, 6509, 6510, 6515, 6519, 6526, 6528, 6541, 6543, 6544, 6545, 6556, 6568, 6569, 6572, 6578, 6590, 6592, 6602, 6611, 6621, 6624, 6625, 6631, 6636, 6644, 6648, 6661, 6666, 6679, 6680, 6690, 6697, 6699, 6700, 6701, 6704, 6707, 6714, 6716, 6717, 6721, 6740, 6746, 6748, 6749, 6751, 6753, 6754, 6761, 6762, 6766, 6767, 6773, 6778, 6782, 6790, 6798, 6800, 6802, 6804, 6810, 6814, 6817, 6826, 6834, 6840, 6845, 6846, 6848, 6862, 6864, 6872, 6873, 6881, 6883, 6886, 6896, 6898, 6903, 6905, 6911, 6914, 6915, 6927, 6934, 6935, 6943, 6948, 6959, 6961, 6967, 6972, 6973, 6974, 6979, 6981, 6985, 6988, 6991, 6994, 7004, 7006, 7024, 7027, 7029, 7033, 7034, 7035, 7040, 7047, 7048, 7064, 7066, 7071, 7073, 7085, 7089, 7100, 7121, 7123, 7125, 7130, 7155, 7160, 7167, 7169, 7173, 7179, 7187, 7191, 7193, 7198, 7202, 7209, 7210, 7218, 7223, 7227, 7234, 7246, 7279, 7281, 7285, 7294, 7297, 7299, 7301, 7311, 7312, 7317, 7324, 7327, 7332, 7343, 7354, 7363, 7388, 7397, 7398, 7403, 7405, 7413, 7426, 7427, 7430, 7452, 7460, 7463, 7465, 7468, 7479, 7481, 7482, 7492, 7493, 7498, 7501, 7503, 7505, 7510, 7522, 7526, 7528, 7529, 7546, 7559, 7562, 7571, 7572, 7573, 7588, 7593, 7602, 7604, 7605, 7607, 7634, 7642, 7643, 7645, 7648, 7657, 7660, 7669, 7695, 7697, 7698, 7701, 7702, 7704, 7707, 7710, 7716, 7719, 7720, 7725, 7726, 7739, 7742, 7746, 7748, 7749, 7751, 7758, 7763, 7768, 7772, 7781, 7789, 7803, 7807, 7809, 7812, 7816, 7819, 7822, 7824, 7825, 7826, 7842, 7850, 7855, 7865, 7872, 7879, 7880, 7888, 7896, 7905, 7941, 7942, 7944, 7951, 7968, 7977, 7982, 7986, 8002, 8025, 8036, 8037, 8040, 8046, 8047, 8048, 8052, 8066, 8069, 8073, 8084, 8085, 8088, 8089, 8091, 8096, 8125, 8128, 8130, 8138, 8156, 8157, 8161, 8166, 8167, 8174, 8176, 8179, 8180, 8184, 8187, 8207, 8211, 8214, 8216, 8218, 8231, 8234, 8238, 8240, 8263, 8269, 8272, 8274, 8280, 8285, 8292, 8293, 8301, 8305, 8310, 8311, 8314, 8316, 8318, 8320, 8321, 8329, 8330, 8332, 8334, 8335, 8336, 8337, 8348, 8351, 8362, 8366, 8367, 8370, 8379, 8381, 8385, 8402, 8406, 8409, 8419, 8431, 8436, 8446, 8447, 8449, 8450, 8451, 8452, 8462, 8463, 8472, 8474, 8499, 8508, 8521, 8522, 8528, 8529, 8531, 8536, 8543, 8555, 8567, 8575, 8577, 8581, 8584, 8599, 8603, 8609, 8625, 8627, 8629, 8632, 8635, 8636, 8662, 8672, 8683, 8686, 8687, 8692, 8694, 8704, 8710, 8711, 8713, 8715, 8717, 8724, 8729, 8730, 8745, 8760, 8764, 8768, 8776, 8781, 8786, 8789, 8792, 8793, 8795, 8799, 8801, 8806, 8822, 8824, 8830, 8840, 8841, 8851, 8853, 8860, 8866, 8872, 8887, 8888, 8893, 8896, 8899, 8912, 8913, 8926, 8933, 8935, 8946, 8947, 8948, 8949, 8954, 8956, 8960, 8961, 8963, 8968, 8972, 8973, 8977, 8978, 8983, 8998, 9000, 9001, 9005, 9014, 9016, 9019, 9024, 9028, 9030, 9049, 9055, 9068, 9070, 9071, 9073, 9074, 9082, 9083, 9084, 9091, 9093, 9102, 9103, 9106, 9108, 9123, 9126, 9131, 9135, 9137, 9140, 9142, 9143, 9147, 9154, 9156, 9164, 9166, 9180, 9200, 9206, 9213, 9220, 9232, 9233, 9245, 9251, 9254, 9259, 9265, 9266, 9274, 9282, 9285, 9290, 9291, 9302, 9303, 9306, 9308, 9311, 9324, 9329, 9342, 9347, 9350, 9351, 9355, 9357, 9364, 9372, 9374, 9375, 9377, 9378, 9390, 9396, 9404, 9414, 9418, 9422, 9425, 9426, 9432, 9433, 9439, 9449, 9458, 9464, 9471, 9476, 9482, 9487, 9493, 9494, 9498, 9501, 9509, 9520, 9529, 9531, 9536, 9538, 9539, 9546, 9549, 9561, 9567, 9568, 9587, 9588, 9592, 9595, 9597, 9602, 9606, 9612, 9613, 9615, 9617, 9623, 9626, 9633, 9634, 9638, 9642, 9643, 9646, 9650, 9658, 9664, 9674, 9676, 9683, 9684, 9686, 9689, 9695, 9703, 9705, 9716, 9722, 9723, 9725, 9731, 9733, 9735, 9736, 9742, 9749, 9769, 9770, 9777, 9778, 9781, 9790, 9791, 9799, 9806, 9807, 9816, 9818, 9824, 9827, 9828, 9831, 9833, 9836, 9839, 9848, 9852, 9854, 9857, 9862, 9863, 9866, 9871, 9872, 9874, 9877, 9879, 9881, 9885, 9890, 9897, 9899, 9904, 9907, 9910, 9924, 9925, 9926, 9936, 9945, 9953, 9956, 9967, 9973, 9987, 9991, 9993, 10002, 10005, 10008, 10009, 10010, 10013, 10015, 10035, 10052, 10060, 10065, 10067, 10073, 10077, 10079, 10098, 10102, 10104, 10105, 10109, 10116, 10124, 10133, 10137, 10139, 10140, 10144, 10150, 10151, 10155, 10159, 10160, 10166, 10172, 10177, 10186, 10192, 10193, 10203, 10210, 10218, 10219, 10231, 10245, 10246, 10248, 10252, 10255, 10264, 10266, 10272, 10276, 10283, 10284, 10286, 10287, 10290, 10291, 10298, 10303, 10310, 10313, 10328, 10337, 10338, 10342, 10350, 10363, 10390, 10394, 10396, 10397, 10401, 10411, 10416, 10417, 10422, 10423, 10424, 10425, 10437, 10444, 10446, 10448, 10455, 10458, 10460, 10465, 10467, 10470, 10476, 10480, 10483, 10489, 10498, 10499, 10518, 10522, 10528, 10530, 10531, 10532, 10538, 10540, 10545, 10546, 10556, 10575, 10576, 10577, 10578, 10582, 10609, 10612, 10615, 10616, 10618, 10624, 10634, 10639, 10658, 10659, 10660, 10661, 10670, 10672, 10673, 10681, 10684, 10688, 10691, 10695, 10700, 10709, 10715, 10716, 10727, 10728, 10737, 10740, 10745, 10750, 10758, 10776, 10777, 10780, 10781, 10787, 10793, 10798, 10801, 10802, 10807, 10811, 10828, 10842, 10864, 10874, 10876, 10879, 10894, 10905, 10908, 10915, 10919, 10927, 10930, 10935, 10941, 10942, 10947, 10948, 10954, 10958, 10963, 10964, 10965, 10966, 10971, 10980, 10989, 10998, 11007, 11008, 11016, 11017, 11021, 11023, 11027, 11039, 11049, 11050, 11059, 11060, 11062, 11071, 11074, 11075, 11087, 11090, 11093, 11099, 11101, 11113, 11114, 11116, 11137, 11143, 11144, 11172, 11180, 11187, 11189, 11196, 11198, 11201, 11205, 11206, 11207, 11211, 11213, 11216, 11219, 11220, 11222, 11227, 11230, 11238, 11245, 11260, 11261, 11264, 11271, 11278, 11280, 11286, 11292, 11294, 11297, 11299, 11308, 11314, 11315, 11316, 11317, 11318, 11321, 11322, 11324, 11330, 11334, 11352, 11355, 11358, 11360, 11370, 11371, 11376, 11381, 11391, 11393, 11410, 11428, 11431, 11435, 11440, 11446, 11456, 11457, 11461, 11464, 11468, 11474, 11478, 11484, 11487, 11499, 11506, 11509, 11512, 11515, 11527, 11532, 11536, 11541, 11543, 11545, 11552, 11559, 11561, 11566, 11567, 11569, 11580, 11581, 11582, 11584, 11589, 11596, 11613, 11615, 11616, 11618, 11619, 11620, 11621, 11622, 11623, 11632, 11637, 11656, 11659, 11663, 11682, 11685, 11688, 11693, 11697, 11701, 11707, 11720, 11723, 11731, 11732, 11734, 11750, 11752, 11754, 11757, 11758, 11759, 11761, 11770, 11773, 11777, 11790, 11793, 11796, 11798, 11811, 11826, 11833, 11837, 11840, 11849, 11853, 11854, 11857, 11865, 11875, 11876, 11881, 11890, 11904, 11905, 11907, 11914, 11924, 11939, 11941, 11946, 11956, 11959, 11962, 11964, 11966, 11967, 11969, 11972, 11974, 11990, 11996, 12011, 12013, 12017, 12024, 12026, 12029, 12031, 12035, 12050, 12052, 12054, 12055, 12064, 12065, 12067, 12077, 12083, 12086, 12090, 12092, 12100, 12103, 12113, 12118, 12119, 12121, 12130, 12132, 12134, 12137, 12142, 12145, 12155, 12159, 12163, 12166, 12173, 12174, 12182, 12187, 12193, 12194, 12200, 12205, 12209, 12216, 12217, 12219, 12225, 12226, 12230, 12243, 12244, 12247, 12250, 12254, 12256, 12262, 12270, 12281, 12291, 12299, 12304, 12306, 12312, 12313, 12315, 12317, 12322, 12326, 12330, 12334, 12335, 12345, 12352, 12354, 12360, 12370, 12374, 12375, 12395, 12406, 12407, 12408, 12416, 12425, 12428, 12435, 12442, 12451, 12455, 12458, 12476, 12479, 12486, 12492, 12500, 12518, 12525, 12529, 12537, 12539, 12552, 12562, 12563, 12564, 12568, 12572, 12574, 12576, 12580, 12589, 12591, 12592, 12597, 12600, 12605, 12615, 12621, 12622, 12624, 12625, 12627, 12636, 12637, 12638, 12668, 12670, 12674, 12685, 12686, 12687, 12693, 12696, 12703, 12707, 12713, 12717, 12719, 12720, 12736, 12739, 12744, 12748, 12749, 12753, 12762, 12781, 12792, 12797, 12799, 12803, 12804, 12806, 12811, 12812, 12827, 12828, 12830, 12837, 12841, 12843, 12856, 12857, 12860, 12861, 12865, 12878, 12880, 12883, 12884, 12891, 12904, 12906, 12908, 12909, 12910, 12918, 12919, 12930, 12932, 12936, 12938, 12939, 12943, 12945, 12946, 12957, 12967, 12975, 12984, 12986, 12991, 12994, 12998, 13001, 13003, 13013, 13015, 13022, 13023, 13025, 13026, 13028, 13030, 13035, 13038, 13041, 13042, 13055, 13060, 13068, 13074, 13077, 13078, 13083, 13090, 13101, 13104, 13107, 13112, 13120, 13121, 13125, 13130, 13131, 13133, 13146, 13161, 13166, 13169, 13170, 13181, 13182, 13193, 13198, 13199, 13203, 13207, 13209, 13210, 13216, 13219, 13227, 13229, 13234, 13236, 13243, 13248, 13255, 13256, 13263, 13274, 13278, 13284, 13285, 13290, 13291, 13295, 13303, 13304, 13321, 13326, 13330, 13341, 13343, 13349, 13353, 13357, 13366, 13367, 13384, 13385, 13390, 13391, 13392, 13411, 13419, 13422, 13425, 13448, 13454, 13457, 13462, 13467, 13470, 13474, 13482, 13483, 13493, 13495, 13497, 13498, 13500, 13504, 13508, 13510, 13512, 13529, 13532, 13535, 13541, 13542, 13543, 13547, 13549, 13557, 13563, 13568, 13577, 13581, 13587, 13600, 13609, 13623, 13633, 13636, 13646, 13651, 13652, 13662, 13664, 13668, 13675, 13677, 13680, 13682, 13691, 13694, 13696, 13701, 13708, 13709, 13711, 13720, 13741, 13762, 13763, 13765, 13766, 13772, 13776, 13777, 13784, 13785, 13786, 13788, 13790, 13791, 13798, 13803, 13804, 13811, 13818, 13820, 13824, 13825, 13830, 13832, 13845, 13848, 13856, 13865, 13866, 13868, 13870, 13871, 13873, 13879, 13880, 13884, 13888, 13892, 13896, 13901, 13907, 13910, 13914, 13916, 13918, 13921, 13922, 13927, 13928, 13935, 13949, 13950, 13952, 13957, 13963, 13965, 13972, 13977, 13989, 14000, 14004, 14005, 14022, 14031, 14044, 14045, 14046, 14047, 14064, 14066, 14068, 14070, 14073, 14076, 14078, 14083, 14088, 14089, 14096, 14097, 14099, 14104, 14105, 14109, 14110, 14118, 14121, 14141, 14144, 14145, 14150, 14155, 14158, 14159, 14166, 14168, 14169, 14178, 14180, 14182, 14190, 14192, 14197, 14198, 14199, 14204, 14207, 14209, 14210, 14217, 14222, 14228, 14230, 14238, 14239, 14247, 14250, 14251, 14255, 14266, 14272, 14285, 14287, 14288, 14289, 14292, 14293, 14295, 14300, 14327, 14329, 14330, 14332, 14334, 14343, 14356, 14361, 14378, 14381, 14384, 14386, 14397, 14399, 14405, 14412, 14415, 14418, 14420, 14421, 14426, 14429, 14473, 14480, 14482, 14491, 14498, 14500, 14505, 14506, 14513, 14518, 14528, 14529, 14536, 14540, 14549, 14552, 14554, 14559, 14561, 14564, 14567, 14570, 14571, 14573, 14574, 14579, 14580, 14583, 14584, 14594, 14602, 14604, 14605, 14606, 14611, 14615, 14620, 14629, 14642, 14648, 14662, 14664, 14673, 14674, 14676, 14687, 14689, 14695, 14701, 14705, 14706, 14711, 14713, 14717, 14718, 14721, 14725, 14727, 14737, 14753, 14756, 14757, 14770, 14774, 14782, 14791, 14795, 14801, 14803, 14809, 14812, 14814, 14821, 14826, 14830, 14832, 14836, 14842, 14844, 14846, 14847, 14849, 14855, 14857, 14860, 14861, 14870, 14877, 14879, 14884, 14885, 14887, 14900, 14903, 14905, 14906, 14911, 14913, 14918, 14938, 14940, 14941, 14942, 14950, 14953, 14955, 14956, 14958, 14969, 14979, 14982, 14987, 14990, 15002, 15012, 15016, 15018, 15020, 15028, 15036, 15055, 15067, 15072, 15075, 15080, 15083, 15085, 15087, 15088, 15095, 15098, 15099, 15100, 15101, 15102, 15106, 15109, 15116, 15121, 15122, 15127, 15131, 15159, 15160, 15165, 15171, 15176, 15179, 15190, 15195, 15201, 15220, 15225, 15229, 15230, 15232, 15238, 15250, 15251, 15252, 15256, 15257, 15259, 15260, 15264, 15265, 15269, 15270, 15271, 15279, 15283, 15284, 15285, 15286, 15296, 15300, 15305, 15309, 15313, 15315, 15317, 15320, 15330, 15331, 15335, 15345, 15352, 15356, 15371, 15372, 15376, 15378, 15382, 15383, 15389, 15390, 15396, 15408, 15409, 15417, 15420, 15424, 15440, 15441, 15452, 15458, 15461, 15469, 15471, 15472, 15477, 15479, 15485, 15486, 15493, 15494, 15496, 15497, 15498, 15503, 15514, 15516, 15521, 15532, 15535, 15543, 15545, 15548, 15549, 15560, 15561, 15567, 15574, 15576, 15579, 15588, 15592, 15593, 15596, 15598, 15600, 15609, 15612, 15622, 15625, 15626, 15627, 15632, 15633, 15641, 15643, 15650, 15652, 15660, 15661, 15662, 15667, 15668, 15672, 15684, 15686, 15690, 15693, 15699, 15706, 15718, 15719, 15734, 15741, 15745, 15748, 15755, 15757, 15760, 15773, 15775, 15779, 15788, 15809, 15817, 15818, 15826, 15828, 15830, 15832, 15836, 15844, 15846, 15853, 15857, 15860, 15869, 15873, 15875, 15880, 15890, 15891, 15892, 15893, 15905, 15906, 15909, 15914, 15918, 15924, 15927, 15928, 15930, 15932, 15933, 15938, 15941, 15944, 15948, 15950, 15955, 15956, 15959, 15960, 15964, 15971, 15975, 15981, 15984, 15995, 15996, 15997, 16004, 16005, 16015, 16018, 16020, 16024, 16044, 16046, 16048, 16050, 16051, 16052, 16053, 16060, 16063, 16067, 16071, 16076, 16079, 16086, 16088, 16092, 16093, 16101, 16103, 16108, 16112, 16113, 16114, 16117, 16120, 16124, 16134, 16136

In [191]:
age_series.iloc[age_list]

3        53
7        52
21       54
24       59
25       56
         ..
32542    72
32548    65
32554    53
32558    58
32560    52
Name: age, Length: 6460, dtype: int64

## Accessing elements with loc

- Elements by "string"

In [192]:
# https://faker.readthedocs.io/en/master/
!pip install Faker

Requirement already satisfied: Faker in /usr/local/lib/python3.10/dist-packages (27.4.0)
Requirement already satisfied: python-dateutil>=2.4 in /usr/local/lib/python3.10/dist-packages (from Faker) (2.8.2)
Requirement already satisfied: six>=1.5 in /usr/local/lib/python3.10/dist-packages (from python-dateutil>=2.4->Faker) (1.16.0)

In [193]:
from faker import Faker
fake = Faker()

In [194]:
fake.name()

'Christina Howell'

In [195]:
name_indexes = []
for _ in range(32561):
  name_indexes.append(fake.name())

In [196]:
type(name_indexes), len(name_indexes)

(list, 32561)

In [197]:
name_indexes[0:10]

['Edwin Crawford',
 'Tina Burgess',
 'Sharon Harvey',
 'Tara Gardner',
 'Don King',
 'Patrick Parker',
 'Julia Woods',
 'Thomas Griffith',
 'Jennifer Rivera',
 'Heather Martin']

In [198]:
age_series.size

32561

In [199]:
type(dataset['age']), type(np.array(dataset['age']))

(pandas.core.series.Series, numpy.ndarray)

In [200]:
age_name_series = pd.Series(np.array(dataset['age']), index = name_indexes)
age_name_series

Edwin Crawford        39
Tina Burgess          50
Sharon Harvey         38
Tara Gardner          53
Don King              28
                      ..
Amanda Jordan         27
Roy Duncan            40
Kathy Lucero          58
Laura Alvarado DDS    22
Stephanie Robbins     52
Length: 32561, dtype: int64

In [201]:
age_name_series["Amanda Clark"]

Amanda Clark    26
Amanda Clark    32
dtype: int64

In [202]:
age_name_series["Carol Rodriguez"]

24

In [203]:
age_name_series2 = age_name_series.drop_duplicates()
age_name_series2.size

73

In [204]:
age_name_series2

Edwin Crawford     39
Tina Burgess       50
Sharon Harvey      38
Tara Gardner       53
Don King           28
                   ..
Maria Spencer      83
Erica Rodriguez    84
Suzanne Buck       85
Michael Ponce      86
Denise Jenkins     87
Length: 73, dtype: int64

In [206]:
age_name_series2.loc["Amanda Clark":"Gabriel Thornton"]

KeyError: 'Amanda Clark'

In [ ]:
age_name_series2.loc[["Derek Mitchell","Janet Berg","Stephanie Marks"]]

In [ ]:
age_name_series2.index

In [ ]:
age_name_series3 = age_name_series2.copy()
age_name_series3

In [ ]:
age_name_series3.reset_index(drop = True, inplace = True)

In [ ]:
age_name_series3

In [ ]:
age_name_series3.index

## Ordering

In [232]:
age_name_series

Edwin Crawford        39
Tina Burgess          50
Sharon Harvey         38
Tara Gardner          53
Don King              28
                      ..
Amanda Jordan         27
Roy Duncan            40
Kathy Lucero          58
Laura Alvarado DDS    22
Stephanie Robbins     52
Length: 32561, dtype: int64

In [233]:
age_name_series.sort_values()

Emily Martinez        17
Daniel Gonzalez       17
Elizabeth Morris      17
Jacqueline Lambert    17
Michelle Obrien       17
                      ..
Mr. Jared Ruiz        90
Thomas Carpenter      90
Cynthia Mills         90
Tiffany Avery         90
Shawn Gilbert         90
Length: 32561, dtype: int64

In [209]:
age_name_series.sort_values(ascending = False)

Jill Barnes            90
Roger Miller           90
Andrew Wiley           90
Christopher Watkins    90
Jaime Hinton           90
                       ..
Charles Preston II     17
William Good           17
Joshua Robles          17
Jessica Peterson       17
Desiree Nolan          17
Length: 32561, dtype: int64

In [210]:
age_name_series.sort_index()

Aaron Allen      30
Aaron Andrews    18
Aaron Baker      43
Aaron Barnett    48
Aaron Baxter     36
                 ..
Zoe Anderson     21
Zoe Fisher       39
Zoe Fisher       38
Zoe Moreno       19
Zoe Watts        34
Length: 32561, dtype: int64

In [211]:
age_name_series.sort_index(ascending = False)

Zoe Watts        34
Zoe Moreno       19
Zoe Fisher       38
Zoe Fisher       39
Zoe Anderson     21
                 ..
Aaron Baxter     36
Aaron Barnett    48
Aaron Baker      43
Aaron Andrews    18
Aaron Allen      30
Length: 32561, dtype: int64

In [212]:
sr = age_name_series.sort_values(ascending = False).iloc[0:10]
sr

Jill Barnes            90
Roger Miller           90
Andrew Wiley           90
Christopher Watkins    90
Jaime Hinton           90
Donald Robinson        90
Jasmine West           90
Jeffrey Smith          90
Eric Benitez           90
Taylor Wolf            90
dtype: int64

## Counting

In [234]:
age_name_series

Edwin Crawford        39
Tina Burgess          50
Sharon Harvey         38
Tara Gardner          53
Don King              28
                      ..
Amanda Jordan         27
Roy Duncan            40
Kathy Lucero          58
Laura Alvarado DDS    22
Stephanie Robbins     52
Length: 32561, dtype: int64

In [236]:
age_name_series.value_counts()

36    898
31    888
34    886
23    877
35    876
     ...
83      6
88      3
85      3
86      1
87      1
Name: count, Length: 73, dtype: int64

In [237]:
age_name_series.value_counts(sort = True, normalize = True)

36    0.027579
31    0.027272
34    0.027210
23    0.026934
35    0.026903
        ...
83    0.000184
88    0.000092
85    0.000092
86    0.000031
87    0.000031
Name: proportion, Length: 73, dtype: float64

In [238]:
age_name_series.value_counts(bins = 10)

(38.9, 46.2]      6163
(31.6, 38.9]      6048
(24.3, 31.6]      5890
(16.926, 24.3]    5570
(46.2, 53.5]      3967
(53.5, 60.8]      2591
(60.8, 68.1]      1595
(68.1, 75.4]       496
(75.4, 82.7]       174
(82.7, 90.0]        67
Name: count, dtype: int64

## Filtering

In [242]:
fake.country()

'Swaziland'

In [243]:
country_indexes = []
for _ in range(32561):
  country_indexes.append(fake.country())

In [244]:
country_indexes[0:11]

['Uruguay',
 'Comoros',
 'Venezuela',
 'Comoros',
 'Falkland Islands (Malvinas)',
 'Bosnia and Herzegovina',
 'Maldives',
 'Brazil',
 'Iran',
 'Kenya',
 'San Marino']

In [246]:
country_series = pd.Series(np.array(dataset['age']), index = country_indexes)
country_series

Uruguay                        39
Comoros                        50
Venezuela                      38
Comoros                        53
Falkland Islands (Malvinas)    28
                               ..
American Samoa                 27
Wallis and Futuna              40
Korea                          58
Taiwan                         22
Gabon                          52
Length: 32561, dtype: int64

In [248]:
country_series.loc[country_series > 50]

Comoros                  53
Brazil                   52
Kyrgyz Republic          54
Tanzania                 59
Sao Tome and Principe    56
                         ..
Malta                    72
Canada                   65
Palau                    53
Korea                    58
Gabon                    52
Length: 6460, dtype: int64

In [250]:
country_series.loc[(country_series > 50) & (country_series.index == "India")]

India    59
India    61
India    66
India    66
India    63
India    59
India    80
India    66
India    56
India    64
India    53
India    53
India    64
India    71
India    52
India    65
India    64
India    81
India    52
India    60
India    58
India    51
India    54
India    51
India    53
India    57
India    53
India    53
India    63
India    68
India    51
India    58
India    55
India    62
dtype: int64

In [227]:
country_series.index.isin(["India", "Brazil"])

array([False, False, False, ..., False, False, False])

In [228]:
~country_series.index.isin(["India", "Brazil"])

array([ True,  True,  True, ...,  True,  True,  True])

## Math operations

In [251]:
country_series

Uruguay                        39
Comoros                        50
Venezuela                      38
Comoros                        53
Falkland Islands (Malvinas)    28
                               ..
American Samoa                 27
Wallis and Futuna              40
Korea                          58
Taiwan                         22
Gabon                          52
Length: 32561, dtype: int64

In [252]:
country_series + 2

Uruguay                        41
Comoros                        52
Venezuela                      40
Comoros                        55
Falkland Islands (Malvinas)    30
                               ..
American Samoa                 29
Wallis and Futuna              42
Korea                          60
Taiwan                         24
Gabon                          54
Length: 32561, dtype: int64

In [253]:
country_series.add(2)

Uruguay                        41
Comoros                        52
Venezuela                      40
Comoros                        55
Falkland Islands (Malvinas)    30
                               ..
American Samoa                 29
Wallis and Futuna              42
Korea                          60
Taiwan                         24
Gabon                          54
Length: 32561, dtype: int64

In [254]:
country_series.sub(2)

Uruguay                        37
Comoros                        48
Venezuela                      36
Comoros                        51
Falkland Islands (Malvinas)    26
                               ..
American Samoa                 25
Wallis and Futuna              38
Korea                          56
Taiwan                         20
Gabon                          50
Length: 32561, dtype: int64

In [255]:
country_series.mul(2)

Uruguay                         78
Comoros                        100
Venezuela                       76
Comoros                        106
Falkland Islands (Malvinas)     56
                              ...
American Samoa                  54
Wallis and Futuna               80
Korea                          116
Taiwan                          44
Gabon                          104
Length: 32561, dtype: int64

In [256]:
country_series.div(2)

Uruguay                        19.5
Comoros                        25.0
Venezuela                      19.0
Comoros                        26.5
Falkland Islands (Malvinas)    14.0
                               ...
American Samoa                 13.5
Wallis and Futuna              20.0
Korea                          29.0
Taiwan                         11.0
Gabon                          26.0
Length: 32561, dtype: float64

In [257]:
s1 = pd.Series([20,30,40])
s2 = pd.Series([1,2,3])
s1,s2

(0    20
 1    30
 2    40
 dtype: int64,
 0    1
 1    2
 2    3
 dtype: int64)

In [258]:
s1.add(s2)

0    21
1    32
2    43
dtype: int64

In [259]:
s1.sub(s2)

0    19
1    28
2    37
dtype: int64

In [260]:
s1.mul(s2)

0     20
1     60
2    120
dtype: int64

In [261]:
s1.div(s2)

0    20.000000
1    15.000000
2    13.333333
dtype: float64

## String operations

In [263]:
country_series

Uruguay                        39
Comoros                        50
Venezuela                      38
Comoros                        53
Falkland Islands (Malvinas)    28
                               ..
American Samoa                 27
Wallis and Futuna              40
Korea                          58
Taiwan                         22
Gabon                          52
Length: 32561, dtype: int64

In [265]:
country_series_index = country_series.index.to_series()
country_series_index.reset_index(drop = True, inplace = True)
country_series_index

0                            Uruguay
1                            Comoros
2                          Venezuela
3                            Comoros
4        Falkland Islands (Malvinas)
                    ...
32556                 American Samoa
32557              Wallis and Futuna
32558                          Korea
32559                         Taiwan
32560                          Gabon
Length: 32561, dtype: object

In [270]:
country_series_index.str.contains("Uruguay")

0         True
1        False
2        False
3        False
4        False
         ...
32556    False
32557    False
32558    False
32559    False
32560    False
Length: 32561, dtype: bool

In [271]:
country_series_index.str.upper()

0                            URUGUAY
1                            COMOROS
2                          VENEZUELA
3                            COMOROS
4        FALKLAND ISLANDS (MALVINAS)
                    ...
32556                 AMERICAN SAMOA
32557              WALLIS AND FUTUNA
32558                          KOREA
32559                         TAIWAN
32560                          GABON
Length: 32561, dtype: object

In [272]:
country_series_index.str.lower()

0                            uruguay
1                            comoros
2                          venezuela
3                            comoros
4        falkland islands (malvinas)
                    ...
32556                 american samoa
32557              wallis and futuna
32558                          korea
32559                         taiwan
32560                          gabon
Length: 32561, dtype: object

In [276]:
country_series_index.str.strip("ros")

0                            Uruguay
1                                Com
2                          Venezuela
3                                Com
4        Falkland Islands (Malvinas)
                    ...
32556                 American Samoa
32557              Wallis and Futuna
32558                          Korea
32559                         Taiwan
32560                          Gabon
Length: 32561, dtype: object

In [ ]:
country_series_index.str.split(' ', expand = True)

In [ ]:
country_series_index.str[0:5]

## Numeric grouping

In [287]:
country_series

Uruguay                        39
Comoros                        50
Venezuela                      38
Comoros                        53
Falkland Islands (Malvinas)    28
                               ..
American Samoa                 27
Wallis and Futuna              40
Korea                          58
Taiwan                         22
Gabon                          52
Length: 32561, dtype: int64

In [288]:
country_series.sum()

1256257

In [289]:
country_series.mean()

38.58164675532078

In [290]:
country_series.median()

37.0

In [281]:
country_series.count()

32561

In [282]:
country_series.std()

13.640432553581341

In [283]:
country_series.var()

186.0614002488016

In [284]:
country_series.loc["Brazil"].mean()

38.065693430656935

In [285]:
country_series.loc["India"].mean()

40.369565217391305

In [286]:
country_series.quantile([0.25, 0.5, 0.75])

0.25    28.0
0.50    37.0
0.75    48.0
dtype: float64

## Categorical grouping

In [291]:
country_series_index

0                            Uruguay
1                            Comoros
2                          Venezuela
3                            Comoros
4        Falkland Islands (Malvinas)
                    ...
32556                 American Samoa
32557              Wallis and Futuna
32558                          Korea
32559                         Taiwan
32560                          Gabon
Length: 32561, dtype: object

In [ ]:
country_series_index.value_counts()

In [ ]:
country_series_index.value_counts(normalize = True)

In [ ]:
country_series_index.unique()

In [ ]:
country_series_index.nunique()

## Missing values

In [ ]:
missing_series = pd.Series([1, 2, 3, np.nan, 5, np.nan])
missing_series

In [ ]:
missing_series.isna()

In [ ]:
missing_series.isna().sum()

In [ ]:
missing_series.fillna(0)

In [ ]:
missing_series.dropna()

In [ ]:
missing_series.mean()

In [ ]:
missing_series.fillna(missing_series.mean())

In [ ]:
missing_series = pd.Series(["Apple", "Banana", "Rice", np.nan, "Potato", "Rice"])
missing_series

In [ ]:
missing_series.isna().sum()

In [ ]:
missing_series.fillna("Not informed")

In [ ]:
missing_series.mode().iloc[0]

In [ ]:
missing_series.fillna(missing_series.mode().iloc[0])

## Functions

In [292]:
age_series

0        39
1        50
2        38
3        53
4        28
         ..
32556    27
32557    40
32558    58
32559    22
32560    52
Name: age, Length: 32561, dtype: int64

In [293]:
age_series.loc[age_series < 18]

106      17
209      17
262      17
271      17
335      17
         ..
31772    17
31864    17
31959    17
32282    17
32447    17
Name: age, Length: 395, dtype: int64

In [294]:
def change_age(age):
  if age < 18:
    age = 18
  return age

In [295]:
change_age(30)

30

In [297]:
change_age(15)

18

In [298]:
change_age(17)

18

In [299]:
age_series = age_series.apply(change_age)

In [300]:
age_series.loc[age_series < 18]

Series([], Name: age, dtype: int64)

In [302]:
age_series = age_series.apply(lambda x: 17 if x == 18 else x)

In [303]:
age_series.loc[age_series < 18]

51       17
78       17
80       17
106      17
168      17
         ..
32345    17
32392    17
32443    17
32447    17
32496    17
Name: age, Length: 945, dtype: int64

In [305]:
age_series2 = age_series.iloc[0:6]
age_series2

0    39
1    50
2    38
3    53
4    28
5    37
Name: age, dtype: int64

In [ ]:
age_series2.where(age_series2 < 40, 0)

# Dataframe

## Creating dataframes

In [306]:
data = [['John', 25, 'New York'],
        ['Peter', 30, 'Chicago'],
        ['Maria', 35, 'Dublin'],
        ['Alice', 40, 'Rome']]

In [307]:
type(data)

list

In [308]:
columns = ['Name', 'Age', 'City']

In [309]:
df = pd.DataFrame(data, columns = columns)
df

    Name  Age      City
0   John   25  New York
1  Peter   30   Chicago
2  Maria   35    Dublin
3  Alice   40      Rome

In [310]:
data = {'Name': ['John', 'Peter', 'Maria', 'Alice'],
        'Age': [25, 30, 35, 40],
        'City': ['Nee York', 'Chicago', 'Dublin', 'Rome']}
data

{'Name': ['John', 'Peter', 'Maria', 'Alice'],
 'Age': [25, 30, 35, 40],
 'City': ['Nee York', 'Chicago', 'Dublin', 'Rome']}

In [311]:
type(data)

dict

In [312]:
df = pd.DataFrame(data)
df

    Name  Age      City
0   John   25  Nee York
1  Peter   30   Chicago
2  Maria   35    Dublin
3  Alice   40      Rome

In [313]:
data = np.array([['John', 25, 'New York'],
                 ['Peter', 30, 'Chicago'],
                 ['Maria', 35, 'Dublin'],
                 ['Alice', 40, 'Rome']])

In [314]:
data

array([['John', '25', 'New York'],
       ['Peter', '30', 'Chicago'],
       ['Maria', '35', 'Dublin'],
       ['Alice', '40', 'Rome']], dtype='<U21')

In [315]:
type(data)

numpy.ndarray

In [316]:
df = pd.DataFrame(data, columns = columns)
df

    Name Age      City
0   John  25  New York
1  Peter  30   Chicago
2  Maria  35    Dublin
3  Alice  40      Rome

In [317]:
data = {'Name': pd.Series(['John', 'Peter', 'Maria', 'Alice']),
        'Age': pd.Series([25, 30, 35, 40]),
        'City': pd.Series(['New York', 'Chicago', 'Dublin', 'Rome'])}
data

{'Name': 0     John
 1    Peter
 2    Maria
 3    Alice
 dtype: object,
 'Age': 0    25
 1    30
 2    35
 3    40
 dtype: int64,
 'City': 0    New York
 1     Chicago
 2      Dublin
 3        Rome
 dtype: object}

In [318]:
type(data)

dict

In [319]:
df = pd.DataFrame(data)
df

    Name  Age      City
0   John   25  New York
1  Peter   30   Chicago
2  Maria   35    Dublin
3  Alice   40      Rome

In [320]:
data = {'Name': np.array(['John', 'Peter', 'Maria', 'Alice']),
        'Age': np.array([25, 30, 35, 40]),
        'City': np.array(['New York', 'Chicago', 'Dublin', 'Rome'])}
data

{'Name': array(['John', 'Peter', 'Maria', 'Alice'], dtype='<U5'),
 'Age': array([25, 30, 35, 40]),
 'City': array(['New York', 'Chicago', 'Dublin', 'Rome'], dtype='<U8')}

In [321]:
df = pd.DataFrame(data)
df

    Name  Age      City
0   John   25  New York
1  Peter   30   Chicago
2  Maria   35    Dublin
3  Alice   40      Rome

## Exploring dataframes

In [322]:
dataset = pd.read_csv('/content/census.csv')

FileNotFoundError: [Errno 2] No such file or directory: '/content/census.csv'

In [ ]:
dataset

In [ ]:
dataset.head(6)

In [ ]:
dataset.tail()

In [ ]:
dataset.shape

In [ ]:
32561 * 15

In [ ]:
dataset.size

In [ ]:
dataset.index

In [ ]:
dataset.axes

In [ ]:
dataset.dtypes

In [ ]:
dataset.info()

In [ ]:
dataset.describe()

## Accessing elements using loc e iloc

In [ ]:
dataset["age"]

In [ ]:
type(dataset["age"])

In [ ]:
dataset.age

In [ ]:
dataset.age.mean()

In [ ]:
dataset.age.iloc[0:4]

In [ ]:
dataset[["age", "education"]]

In [ ]:
dataset.iloc[0:4, 0:4] # rows, columns

In [ ]:
dataset.iloc[0:4, :]

In [ ]:
dataset.iloc[0:4, [0, 3, 5]]

In [ ]:
dataset.iloc[:, 0:4]

In [ ]:
dataset.loc[:, "age"]

In [ ]:
dataset.loc[:, ["age", "workclass", "education"]]

In [ ]:
dataset.loc[0:5, "age":"occupation"]

## Deleting rows and columns

In [ ]:
dataset.drop("education", axis = 1) # 0 - rows, 1 - columns

In [ ]:
dataset.drop("final-weight", axis = 1, inplace = True)

In [ ]:
dataset.columns

In [ ]:
dataset.drop([0], axis = 0)

In [ ]:
dataset.drop([0], axis = 0, inplace = True)

In [ ]:
dataset

In [ ]:
dataset.reset_index(drop = True, inplace = True)

In [ ]:
dataset.head()

## Duplicated rows

In [ ]:
dataset.duplicated()

In [ ]:
dataset.duplicated().sum()

In [ ]:
dataset.iloc[[32556, 32558]]

In [ ]:
dataset.drop_duplicates()

In [ ]:
dataset.drop_duplicates(subset = "age", keep = "last", ignore_index=True)

## Missing values

In [ ]:
dataset.isna().sum()

In [ ]:
dataset.loc[dataset['workclass'].str.contains("\?")] # NaN

In [ ]:
dataset["workclass"].str.contains("\?").sum()

In [ ]:
categorical_columns = ['workclass', 'education', 'marital-status', 'occupation', 'relationship', 'race', 'sex', 'native-country']

for column in categorical_columns:
  #print(column)
  has_question = dataset[column].str.contains("\?").any()
  if has_question:
    print(f"Question mark found in column '{column}'")

In [ ]:
for column in categorical_columns:
  dataset[column] = dataset[column].replace(' ?', np.nan)

In [ ]:
dataset.isna().sum()

In [ ]:
dataset.fillna("NOT INFORMED").iloc[0:30] # inplace

In [ ]:
dataset["workclass"].mode()

In [ ]:
dataset["occupation"].mode()

In [ ]:
dataset["native-country"].mode()

In [ ]:
dataset["workclass"].fillna(dataset["workclass"].mode().iloc[0], inplace = True)

In [ ]:
dataset["occupation"].fillna(dataset["occupation"].mode().iloc[0], inplace = True)

In [ ]:
dataset["native-country"].fillna(dataset["native-country"].mode().iloc[0], inplace = True)

In [ ]:
dataset.isna().sum()

In [ ]:
dataset.dropna(subset = "workclass") # inplace

## Counting

In [ ]:
dataset.value_counts()

In [ ]:
dataset.age.value_counts()

In [ ]:
dataset.workclass.value_counts()

In [ ]:
dataset.workclass.value_counts(normalize = True, sort = False)

In [ ]:
for column in dataset.columns:
  #print(column, dataset[column].dtype)
  if dataset[column].dtype == object:
    print('---------', column, '----------')
    print(dataset[column].value_counts(normalize = True))
    print()

## Ordering

In [ ]:
dataset.sort_index(ascending = False)

In [ ]:
dataset.sort_values(["age", "workclass", "education-num"], ascending = [False, True, False], inplace = True)

In [ ]:
dataset

In [ ]:
dataset.reset_index(drop = True, inplace = True)

In [ ]:
dataset

## Filtering

In [ ]:
dataset.loc[dataset.education == ' Bachelors', ["age", "workclass", "education-num"]] # rows, columns

In [ ]:
dataset.loc[(dataset["education-num"] == 6) & (dataset["marital-status"] == " Never-married")]

In [ ]:
# SQL
dataset.query("`education-num` == 6 and `marital-status` == ' Never-married'")

In [ ]:
dataset.query("age > 35 and workclass == ' Private'")

In [ ]:
dataset.query("age > 35 and workclass == ' Private'").loc[:, "capital-gain"].sum()

## Rename and reorder

In [ ]:
dataset.columns

In [ ]:
dataset.columns = [column.upper() for column in dataset.columns]

In [ ]:
dataset.columns

In [ ]:
dataset.columns = [column.lower() for column in dataset.columns]

In [ ]:
dataset.columns

In [ ]:
dataset.rename(columns = {"age": "age2", "workclass": "workclass2"}, inplace = True)

In [ ]:
dataset.columns

In [ ]:
dataset.rename(columns = {"age2": "age", "workclass2": "workclass"}, inplace = True)

In [ ]:
dataset.columns

In [ ]:
dataset.head()

In [ ]:
dataset = dataset.reindex(labels = ['workclass', 'age', 'education', 'education-num', 'marital-status',
       'occupation', 'relationship', 'race', 'sex', 'capital-gain',
       'capital-loos', 'hour-per-week', 'native-country', 'income'], axis = 1) # 0 rows, 1 columns

In [ ]:
dataset

## Creating new columns

In [ ]:
dataset["hour-per-month"] = dataset["hour-per-week"] * 4

In [ ]:
dataset.head()

In [ ]:
dataset["high-education-level"] = dataset["education-num"] > 11

In [ ]:
dataset

In [ ]:
map_dictionary = {" <=50K": "Low", " >50K": "High"}

In [ ]:
type(map_dictionary)

In [ ]:
dataset["category-income"] = dataset["income"].map(map_dictionary)

In [ ]:
dataset

In [ ]:
dataset["capital-gain-usd"] = dataset["capital-gain"].map(lambda x: f"USD {x}")

In [ ]:
dataset

In [ ]:
from datetime import datetime

In [ ]:
datetime.now().year

In [ ]:
dataset = dataset.assign(birth = datetime.now().year - dataset["age"],
                         hardwork = dataset["hour-per-week"] > 40)

In [ ]:
dataset

In [ ]:
dataset.loc[dataset["hardwork"] == True]

## Categorical columns

In [ ]:
dataset.info()

In [ ]:
dataset["native-country"].unique(), dataset["native-country"].nunique()

In [ ]:
dataset = dataset.astype({"native-country": "category"})

In [ ]:
dataset.info()

In [ ]:
dataset

## Aggregation

In [ ]:
dataset.loc[:, "hour-per-week"].sum()

In [ ]:
dataset.loc[:, ["hour-per-week", "age"]].sum()

In [ ]:
dataset.loc[:, ["hour-per-week", "age"]].mean().round(2)

In [ ]:
dataset.loc[:, ["hour-per-week", "age"]].std().round(2)

In [ ]:
dataset.loc[:, ["hour-per-week", "age"]].min().round(2)

In [ ]:
dataset.loc[:, ["hour-per-week", "age"]].max().round(2)

In [ ]:
dataset.mean(numeric_only = True)

## Grouping

In [ ]:
dataset["workclass"].unique()

In [ ]:
dataset.groupby("workclass")["hour-per-week"].mean().sort_values(ascending = False)

In [ ]:
group = dataset.groupby("workclass")["hour-per-week"].mean().sort_values(ascending = False)

In [ ]:
type(group)

In [ ]:
group

In [ ]:
dataset.groupby("income")["education-num"].mean().round(2).sort_values(ascending = False)

In [ ]:
group = dataset.groupby(["income", "workclass"])["hour-per-week"].mean().sort_index()
group

In [ ]:
type(group)

In [ ]:
group.index # composite primary key - SQL

In [ ]:
group.loc[" <=50K"]

In [ ]:
group.loc[(" <=50K", " Federal-gov")]

In [ ]:
group.loc[(" <=50K", " Federal-gov"):(" <=50K", " Private")]

In [ ]:
group.loc[" <=50K"][" Federal-gov":" Never-worked"]

In [ ]:
group = dataset.groupby(["income", "workclass"], as_index = False)["hour-per-week"].mean().sort_index()
group

In [ ]:
type(group)

In [ ]:
group.query("workclass == ' Federal-gov'")

## Aggregation with grouping

In [ ]:
dataset.groupby(["income", "workclass"]).agg("mean", numeric_only = True)

In [ ]:
dataset.groupby(["income", "workclass"]).agg({"age": ["mean", "std"],
                                              "hour-per-week": ["min", "max"]})

In [ ]:
dataset.groupby(["income", "workclass"]).agg(age_mean = ("age", "mean"),
                                           age_std = ("age", "std"),
                                           hour_min = ("hour-per-week", "min"),
                                           hour_max = ("hour-per-week", "max"))

## Aggregation with transform

In [ ]:
group = dataset.groupby(["workclass"], as_index = False)["hour-per-week"].mean().sort_index()
group

In [ ]:
group.assign(avg_age = dataset.groupby(["workclass"])["age"].transform("mean"),
             avg_education = dataset.groupby(["workclass"])["education-num"].transform("mean"))

## Pivot tables

In [ ]:
dataset.pivot_table(index = "income",
                    columns = "workclass",
                    values = "age",
                    aggfunc = "mean",
                    margins = True)

In [ ]:
dataset.pivot_table(index = "marital-status",
                    columns = "income",
                    values = "education-num",
                    aggfunc = "mean",
                    margins = True)

In [ ]:
dataset.pivot_table(index = "marital-status",
                    columns = "income",
                    values = "education-num",
                    aggfunc = ("mean", "max", "min"))

In [ ]:
dataset.pivot_table(index = "marital-status",
                    columns = "income",
                    values = "education-num",
                    aggfunc = ("mean", "max")).style.background_gradient(cmap = "Blues")

## Concatenation

In [ ]:
data = {'sale_id': [123, 374, 654, 345],
        'date': ['2024-01-19', '2024-01-20', '2024-02-21', '2024-02-25'],
        'seller_id': [1, np.nan, 2, 3],
        'total': [45.76, 102.34, 56.34, 34.21]}
df1 = pd.DataFrame.from_dict(data)
df1

In [ ]:
data = {'sale_id': [546, 232, 789, 2345],
        'date': ['2024-01-22', '2024-01-22', '2024-03-23', '2024-03-24'],
        'seller_id': [3, 2, 1, 2],
        'total': [40.43, 10.12, 56.56, 56.01]}
df2 = pd.DataFrame.from_dict(data)
df2

In [ ]:
data_complete = pd.concat([df1, df2], ignore_index=True)
data_complete

In [ ]:
data_complete.query("seller_id == 1")

In [ ]:
data_complete.query("seller_id == 2")

## Joining

In [ ]:
data = {'seller_id': [1, 2, 3, 4],
        'name': ['Maria', 'Peter', 'Jessica', 'John']}
df_seller = pd.DataFrame.from_dict(data)
df_seller

In [ ]:
data_complete.merge(df_seller,
                    how = "inner",
                    left_on = ["seller_id"],
                    right_on = ["seller_id"])

In [ ]:
data_complete = data_complete.merge(df_seller,
                    how = "left",
                    left_on = ["seller_id"],
                    right_on = ["seller_id"])

In [ ]:
data_complete.columns

In [ ]:
data_complete.query("name == 'Jessica'")

## Date convertions

In [ ]:
df_sales = data_complete.copy()

In [ ]:
df_sales.info()

In [ ]:
df_sales.loc[0, ["date"]] = "N/A"

In [ ]:
df_sales

In [ ]:
df_sales = df_sales.astype({"date": "datetime64[ns]"})

In [ ]:
# https://pandas.pydata.org/docs/reference/api/pandas.to_datetime.html
df_sales = df_sales.assign(date = pd.to_datetime(df_sales["date"],
                                                 #infer_datetime_format = True,
                                                 errors = "coerce")) # NaT (not a time) -> NaN (not a number)

In [ ]:
df_sales

In [ ]:
df_sales.info()

### Formatation

- https://www.programiz.com/python-programming/datetime/strftime

In [ ]:
df_sales.assign(date2 = df_sales["date"].dt.strftime("%Y-%b-%a"),
                date3 = df_sales["date"].dt.strftime("%d-%m-%Y"))

In [ ]:
df_sales["date"].fillna("2024-01-19", inplace = True)

In [ ]:
df_sales

In [ ]:
df_sales["date"].dt.year

In [ ]:
df_sales["date"].dt.month

In [ ]:
df_sales["date"].dt.hour

In [ ]:
df_sales["date"].dt.minute

In [ ]:
df_sales["date"].dt.second

In [ ]:
df_sales["date"].dt.quarter

## Dates indexes

In [ ]:
df_sales2 = df_sales.copy()
df_sales2

In [ ]:
df_sales2.dtypes

In [ ]:
df_sales2.set_index("date", inplace = True)
df_sales2

In [ ]:
df_sales2.loc["2024"]

In [ ]:
df_sales2.loc["2024-01-20":"2024-02-21"]

In [ ]:
df_sales2.resample('M')["total"].sum(numeric_only = True)

In [ ]:
df_sales2.resample('D')["total"].sum(numeric_only = True)

In [ ]:
df_sales2.resample('M')["total"].mean(numeric_only = True)

## Importation and exportation

- Documentation: https://pandas.pydata.org/docs/reference/api/pandas.read_csv.html

In [ ]:
dataset = pd.read_csv('census.csv').head(5)
dataset

In [ ]:
dataset.info()

In [ ]:
dataset = pd.read_csv('census.csv', header = None).head(5)
dataset

In [ ]:
columns = ['age',	'workclass', 'final-weight', 'education', 'education-num', 'marital-status', 'occupation', 'relationship', 'race', 'sex', 'capital-gain', 'capital-loos', 'hour-per-week', 'native-country', 'income']
dataset = pd.read_csv('census.csv', header = None, names=columns).head(5)
dataset

In [ ]:
dataset = pd.read_csv('census.csv', usecols = ["age", "workclass"]).head(5)
dataset

In [ ]:
dataset = pd.read_csv('census.csv', na_values = [" ?"])

In [ ]:
dataset.isna().sum()

In [ ]:
dataset.dtypes

In [ ]:
dataset = pd.read_csv("census.csv", dtype = ({"final-weight": "float"}))
dataset.dtypes

In [ ]:
currency = lambda x: f"{x} USD"
dataset = pd.read_csv('census.csv', converters = {"capital-gain": currency})
dataset

In [ ]:
dataset = pd.read_csv('/content/AirPassengers.csv', parse_dates = ["Month"], index_col = "Month")
dataset

In [ ]:
dataset.dtypes

In [ ]:
# https://archive.ics.uci.edu/ml/machine-learning-databases/00236/seeds_dataset.txt
dataset = pd.read_csv('/content/seeds_dataset.txt', sep = "\t", header = None,
                      names = ["a", "b", "c", "d", "e", "f", "g", "h"])
dataset

In [ ]:
dataset = pd.read_excel('seeds.xlsx', header = None, sheet_name = "Planilha2")
dataset

In [ ]:
dataset.to_csv('test.csv', index = False)

In [ ]:
dataset.to_excel("test.xlsx", sheet_name = "Testing", index=False)

# Data visualization

## Line plot

- Documentation: https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.plot.html

In [ ]:
dataset = pd.read_csv('AirPassengers.csv')
dataset

In [ ]:
dataset.plot();

In [ ]:
dataset.set_index("Month").plot();

In [ ]:
dataset.plot(x = "Month");

In [ ]:
dataset.set_index("Month").loc["1949-01":"1949-12"].plot();

## Formatting

In [ ]:
dataset.set_index("Month").loc["1949-01":"1949-12"].plot(title = "Flights in 1949",
                                                         xlabel = "Date",
                                                         ylabel = "Quantity",
                                                         color = "red",
                                                         style = "-.",
                                                         legend = True).legend(loc = "best");

In [ ]:
dataset.set_index("Month").loc["1949-01":"1949-12"].plot(title = "Flights in 1949",
                                                         xlabel = "Date",
                                                         ylabel = "Quantity",
                                                         color = "red",
                                                         style = "-.",
                                                         legend = True).legend(bbox_to_anchor = (1.3,1));

In [ ]:
# https://seaborn.pydata.org/generated/seaborn.set_style.html
import seaborn as sns
sns.set_style("darkgrid")

In [ ]:
dataset.set_index("Month").loc["1949-01":"1949-12"].plot(title = "Flights in 1949",
                                                         xlabel = "Date",
                                                         ylabel = "Quantity",
                                                         color = "red",
                                                         style = "-.",
                                                         legend = True).legend(bbox_to_anchor = (1.3,1));

## Sub-plots

In [ ]:
dataset = pd.read_csv('census.csv')
dataset.dtypes

In [ ]:
dataset.plot(subplots = True);

In [ ]:
dataset.plot(subplots = True, layout = (3,3), figsize = (20,20),
             title = ["Age", "Final", "Education", "Gain", "Loss", "Hous"],
             legend = False, kind = "hist");

## Bar plot

In [ ]:
dataset.workclass.unique()

In [ ]:
dataset.groupby("workclass")["age"].count().plot(kind = "bar");

In [ ]:
dataset.groupby("workclass")["age"].count().plot.barh();

In [ ]:
pivot = dataset.query("workclass != ' Never-worked' and workclass != ' Without-pay'").pivot_table(index = "income",
                            columns = "workclass",
                            values = "education-num",
                            aggfunc = "sum").apply(lambda x: x * 100 / sum(x), axis = 1)
pivot

In [ ]:
pivot.plot.bar().legend(bbox_to_anchor = (1.4, 1));

In [ ]:
pivot.plot.bar(stacked = True).legend(bbox_to_anchor = (1.4,1));

## Pizza/pie plot

In [ ]:
dataset.groupby("workclass")["age"].count().plot.pie(title = "Workclass", ylabel = "");

## Scatter plot

In [ ]:
dataset.columns

In [ ]:
dataset.plot.scatter(x = "education-num", y = "capital-gain");

In [ ]:
dataset.plot.scatter(x = "education-num", y = "income");

In [ ]:
dataset.plot.scatter(x = "hour-per-week", y = "education-num");

In [ ]:
dataset.plot.scatter(x = "hour-per-week", y = "capital-gain");

## Histogram

In [ ]:
dataset["age"].plot.hist();

In [ ]:
dataset["education-num"].plot.hist();

In [ ]:
dataset["capital-gain"].plot.hist();

In [ ]:
dataset[["age", "education-num"]].plot.hist(alpha = 0.4);

In [ ]:
plot = dataset.plot.hist(alpha = 0.3);

In [ ]:
plot.figure.savefig("histogram.png")